/*
* Java语言关键字和保留字
* */

package day01;

public class KeyReserved {
    /*
    一、关键字（Keyword）
        1、定义：被Java语言赋予了特殊含义，用作专门用途的字符串（单词）
        2、特点：关键字中所有子么都为小写
        3、官方网址：http://docs.oracle.com/javase/tutorial/java/nutsandbolts/_keywords.html
        4、true、false、null：用于定义数据类型的字面值。严格讲不算关键字，但又当做关键字用
    二、保留字
	    1、Java现有版本尚未使用，但以后的版本可能作为关键字使用。定义变量时要保留
    三、标志符
        1、定义：变量名、方法名、类名、接口名等自定义的，都是标志符
	2、命名规则：
		>由26个英文字母大小写、0-9 ，_ 和$
		>不能以数字开头，不能包含空格
		>长度无限制，严格区分大小写
		>不能与保留字和关键字冲突
	3、命名规范
		>包名：多单词组成时，单词全部小写
		>类名、接口名：单词首字母大写
		>变量名、方法名：第一个单词小写，其余单词首字母大写
		>常量名：所有字母都大写，多单词之间用下划线连接，如XXX_YYY_ZZZ
		>自定义命名时要见名知意，不要随意起名，遵守习惯
    * */
}
